app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "this is my intrest"], ["picture", "Rails_AntiPatterns.pdf"], ["user_id", 1], ["created_at", "2015-01-22 13:49:58.015278"], ["updated_at", "2015-01-22 13:49:58.015278"]]

  def destroy
    @micropost.destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 1]]