app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]